{"path":"api/fluxmixin","content":"`fluxMixin`\n===========\n\nAccess the Flux instance and subscribe to store updates. Refer to the [React integration guide](../guides/react-integration.md) for more information.\n\nNote that fluxMixin is actually a function that returns a mixin, as the example below shows. The parameters are the same as those for `connectToStores()`, described below. On component initialization, `connectToStores()` is called and used to set the initial state of the component.\n\n```js\nimport fluxMixin from 'flummox/mixin';\n\nlet MyComponent = React.createClass({\n\n  mixins[fluxMixin(['storeA', 'storeB'])],\n\n  ...\n});\n```\n\nIn general, [it's recommended to use FluxComponent instead of fluxMixin](../guides/why-flux-component-is-better-than-flux-mixin.md).\n\nState getters\n-------------\n\nWhen connecting to stores with fluxMixin (and FluxComponent), you'll usually want to specify custom state getters.\n\nA state getter is a function which returns a state object for a given store. The state object is merged into the component state using `setState()`.\n\nThe default state getter returns the entire store state. You can specify null as a state getter to use the default state getter.\n\nHere's an example of a state getter map you would pass to either `fluxMixin()` or `connectToStores()`. The keys are store keys, and the values are state getter functions.\n\n```js\nfluxMixin({\n  posts: (store, props) =>({\n    storeA: store.getPost(props.post.id),\n  }),\n  comments: (store, props) => ({\n    comments: store.getCommentsForPost(props.post.id),\n  })\n});\n```\n\nIn some situations the data retrieved from one store depends on the state from another, you can use an array of store keys with a custom state getter to ensure the components state is updated when either store changes:\n\n```js\nfluxMixin(\n  ['posts', 'session'],\n\n  // An array of store instances are passed to the state getter; Instead of indexing\n  // into the stores array, ES6 array destructuring is used to access each store\n  // as a variable.\n  ([postStore, sessionStore]) => ({\n    posts: store.getPostForUser(sessionStore.getCurrentUserId())\n  })\n);\n```\n\nAccess flux with `this.flux`\n----------------------------\n\nYou can access the Flux instance with `this.flux`. For example, to perform an action:\n\n```js\nonClick(e) {\n  e.preventDefault();\n  this.flux.getActions('actionsKey').someAction();\n}\n```\n\n\nMethods\n-------\n\n### connectToStores\n\n```js\nconnectToStores(string storeKey [, function stateGetter])\nconnectToStores(Array<string> storeKeys [, function stateGetter])\nconnectToStores(object stateGetterMap [, function stateGetter])\n```\n\nSynchronize component state with state from Flux stores. Pass a single store key, an array of store keys, or a map of store keys to getter functions. You can also specify a custom state getter as the second argument, the default state getter will return the entire store state (a reduce is performed on the entire store state when using an array or store keys).\n\nWhen using an array of store keys, the custom state getter is called with an array of store instances (same order as keys) as the first argument; An array is used instead of separate arguments to allow for future versions of flummox to pass additional arguments to the stateGetter eg. `props`.\n\nOtherwise only a single store instance is passed to the custom state getter.\n\nReturns the initial combined state of the specified stores.\n\n**Usage note**: Generally, you should avoid calling this directly and instead pass arguments to `fluxMixin()`, which calls this internally.\n\n### getStoreState\n\n```\ngetStoreState()\n```\n\nReturns current combined state of connected stores.\n"}